### Terraform Plan

<details>
<summary>Click to see the plan</summary>

```
[command]/home/runner/work/_temp/5c409d34-9207-4c64-af02-3ddec41c45dd/terraform-bin show -no-color tfplan

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.ecs_service.data.aws_region.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_region" "current" {
      + description = (known after apply)
      + endpoint    = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
    }

  # module.ecs_service.aws_ecs_service.main will be updated in-place
  ~ resource "aws_ecs_service" "main" {
        id                                 = "arn:aws:ecs:us-east-1:654654485498:service/hello-world-api-cluster/hello-world-api-service"
        name                               = "hello-world-api-service"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:us-east-1:654654485498:task-definition/hello-world-api:2" -> (known after apply)
        # (15 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.ecs_service.aws_ecs_task_definition.main must be replaced
-/+ resource "aws_ecs_task_definition" "main" {
      ~ arn                      = "arn:aws:ecs:us-east-1:654654485498:task-definition/hello-world-api:2" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-east-1:654654485498:task-definition/hello-world-api" -> (known after apply)
      ~ container_definitions    = jsonencode(
            [
              - {
                  - cpu              = 0
                  - environment      = []
                  - essential        = true
                  - image            = "654654485498.dkr.ecr.us-east-1.amazonaws.com/hello-world-api:latest"
                  - logConfiguration = {
                      - logDriver = "awslogs"
                      - options   = {
                          - awslogs-group         = "/ecs/hello-world-api"
                          - awslogs-region        = "us-east-1"
                          - awslogs-stream-prefix = "ecs"
                        }
                    }
                  - mountPoints      = []
                  - name             = "hello-world-api"
                  - portMappings     = [
                      - {
                          - containerPort = 3000
                          - hostPort      = 3000
                          - protocol      = "tcp"
                        },
                    ]
                  - systemControls   = []
                  - volumesFrom      = []
                },
            ]
        ) -> (known after apply) # forces replacement
      ~ id                       = "hello-world-api" -> (known after apply)
      ~ revision                 = 2 -> (known after apply)
      - tags                     = {} -> null
      ~ tags_all                 = {} -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.load_balancer.aws_acm_certificate.cert will be created
  + resource "aws_acm_certificate" "cert" {
      + arn                       = (known after apply)
      + domain_name               = "lucasherculano.xyz"
      + domain_validation_options = [
          + {
              + domain_name           = "lucasherculano.xyz"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
        ]
      + id                        = (known after apply)
      + key_algorithm             = (known after apply)
      + not_after                 = (known after apply)
      + not_before                = (known after apply)
      + pending_renewal           = (known after apply)
      + renewal_eligibility       = (known after apply)
      + renewal_summary           = (known after apply)
      + status                    = (known after apply)
      + subject_alternative_names = [
          + "lucasherculano.xyz",
        ]
      + tags_all                  = (known after apply)
      + type                      = (known after apply)
      + validation_emails         = (known after apply)
      + validation_method         = "DNS"

      + options (known after apply)
    }

  # module.load_balancer.aws_acm_certificate_validation.cert will be created
  + resource "aws_acm_certificate_validation" "cert" {
      + certificate_arn         = (known after apply)
      + id                      = (known after apply)
      + validation_record_fqdns = (known after apply)
    }

  # module.load_balancer.aws_lb_listener.http will be updated in-place
  ~ resource "aws_lb_listener" "http" {
        id                = "arn:aws:elasticloadbalancing:us-east-1:654654485498:listener/app/hello-world-api-alb/e5c80950ca5bfd6e/8a6a2b8cbee58cc5"
        tags              = {}
        # (6 unchanged attributes hidden)

      ~ default_action {
          ~ type             = "forward" -> "redirect"
            # (2 unchanged attributes hidden)

          + redirect {
              + host        = "#{host}"
              + path        = "/#{path}"
              + port        = "443"
              + protocol    = "HTTPS"
              + query       = "#{query}"
              + status_code = "HTTP_301"
            }
        }
    }

  # module.load_balancer.aws_lb_listener.https[0] will be created
  + resource "aws_lb_listener" "https" {
      + arn               = (known after apply)
      + certificate_arn   = (known after apply)
      + id                = (known after apply)
      + load_balancer_arn = "arn:aws:elasticloadbalancing:us-east-1:654654485498:loadbalancer/app/hello-world-api-alb/e5c80950ca5bfd6e"
      + port              = 443
      + protocol          = "HTTPS"
      + ssl_policy        = "ELBSecurityPolicy-2016-08"
      + tags_all          = (known after apply)

      + default_action {
          + order            = (known after apply)
          + target_group_arn = "arn:aws:elasticloadbalancing:us-east-1:654654485498:targetgroup/hello-world-api-tg/feeb4478cc4dc18f"
          + type             = "forward"
        }

      + mutual_authentication (known after apply)
    }

  # module.load_balancer.aws_route53_record.cert_validation["lucasherculano.xyz"] will be created
  + resource "aws_route53_record" "cert_validation" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = "Z04073202OY1O6A1PI872"
    }

  # module.load_balancer.aws_security_group.alb will be updated in-place
  ~ resource "aws_security_group" "alb" {
        id                     = "sg-023bff4452cc0cdb2"
      ~ ingress                = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - from_port        = 80
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 80
                # (1 unchanged attribute hidden)
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + from_port        = 443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 443
                # (1 unchanged attribute hidden)
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 80
            },
        ]
        name                   = "hello-world-api-alb-sg"
        tags                   = {}
        # (8 unchanged attributes hidden)
    }

Plan: 5 to add, 3 to change, 1 to destroy.
::debug::Terraform exited with code 0.
::debug::stdout: %0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A  ~ update in-place%0A-/+ destroy and then create replacement%0A <= read (data resources)%0A%0ATerraform will perform the following actions:%0A%0A  # module.ecs_service.data.aws_region.current will be read during apply%0A  # (depends on a resource or a module with changes pending)%0A <= data "aws_region" "current" {%0A      + description = (known after apply)%0A      + endpoint    = (known after apply)%0A      + id          = (known after apply)%0A      + name        = (known after apply)%0A    }%0A%0A  # module.ecs_service.aws_ecs_service.main will be updated in-place%0A  ~ resource "aws_ecs_service" "main" {%0A        id                                 = "arn:aws:ecs:us-east-1:654654485498:service/hello-world-api-cluster/hello-world-api-service"%0A        name                               = "hello-world-api-service"%0A        tags                               = {}%0A      ~ task_definition                    = "arn:aws:ecs:us-east-1:654654485498:task-definition/hello-world-api:2" -> (known after apply)%0A        # (15 unchanged attributes hidden)%0A%0A        # (4 unchanged blocks hidden)%0A    }%0A%0A  # module.ecs_service.aws_ecs_task_definition.main must be replaced%0A-/+ resource "aws_ecs_task_definition" "main" {%0A      ~ arn                      = "arn:aws:ecs:us-east-1:654654485498:task-definition/hello-world-api:2" -> (known after apply)%0A      ~ arn_without_revision     = "arn:aws:ecs:us-east-1:654654485498:task-definition/hello-world-api" -> (known after apply)%0A      ~ container_definitions    = jsonencode(%0A            [%0A              - {%0A                  - cpu              = 0%0A                  - environment      = []%0A                  - essential        = true%0A                  - image            = "654654485498.dkr.ecr.us-east-1.amazonaws.com/hello-world-api:latest"%0A                  - logConfiguration = {%0A                      - logDriver = "awslogs"%0A                      - options   = {%0A                          - awslogs-group         = "/ecs/hello-world-api"%0A                          - awslogs-region        = "us-east-1"%0A                          - awslogs-stream-prefix = "ecs"%0A                        }%0A                    }%0A                  - mountPoints      = []%0A                  - name             = "hello-world-api"%0A                  - portMappings     = [%0A                      - {%0A                          - containerPort = 3000%0A                          - hostPort      = 3000%0A                          - protocol      = "tcp"%0A                        },%0A                    ]%0A                  - systemControls   = []%0A                  - volumesFrom      = []%0A                },%0A            ]%0A        ) -> (known after apply) # forces replacement%0A      ~ id                       = "hello-world-api" -> (known after apply)%0A      ~ revision                 = 2 -> (known after apply)%0A      - tags                     = {} -> null%0A      ~ tags_all                 = {} -> (known after apply)%0A        # (11 unchanged attributes hidden)%0A    }%0A%0A  # module.load_balancer.aws_acm_certificate.cert will be created%0A  + resource "aws_acm_certificate" "cert" {%0A      + arn                       = (known after apply)%0A      + domain_name               = "lucasherculano.xyz"%0A      + domain_validation_options = [%0A          + {%0A              + domain_name           = "lucasherculano.xyz"%0A              + resource_record_name  = (known after apply)%0A              + resource_record_type  = (known after apply)%0A              + resource_record_value = (known after apply)%0A            },%0A        ]%0A      + id                        = (known after apply)%0A      + key_algorithm             = (known after apply)%0A      + not_after                 = (known after apply)%0A      + not_before                = (known after apply)%0A      + pending_renewal           = (known after apply)%0A      + renewal_eligibility       = (known after apply)%0A      + renewal_summary           = (known after apply)%0A      + status                    = (known after apply)%0A      + subject_alternative_names = [%0A          + "lucasherculano.xyz",%0A        ]%0A      + tags_all                  = (known after apply)%0A      + type                      = (known after apply)%0A      + validation_emails         = (known after apply)%0A      + validation_method         = "DNS"%0A%0A      + options (known after apply)%0A    }%0A%0A  # module.load_balancer.aws_acm_certificate_validation.cert will be created%0A  + resource "aws_acm_certificate_validation" "cert" {%0A      + certificate_arn         = (known after apply)%0A      + id                      = (known after apply)%0A      + validation_record_fqdns = (known after apply)%0A    }%0A%0A  # module.load_balancer.aws_lb_listener.http will be updated in-place%0A  ~ resource "aws_lb_listener" "http" {%0A        id                = "arn:aws:elasticloadbalancing:us-east-1:654654485498:listener/app/hello-world-api-alb/e5c80950ca5bfd6e/8a6a2b8cbee58cc5"%0A        tags              = {}%0A        # (6 unchanged attributes hidden)%0A%0A      ~ default_action {%0A          ~ type             = "forward" -> "redirect"%0A            # (2 unchanged attributes hidden)%0A%0A          + redirect {%0A              + host        = "#{host}"%0A              + path        = "/#{path}"%0A              + port        = "443"%0A              + protocol    = "HTTPS"%0A              + query       = "#{query}"%0A              + status_code = "HTTP_301"%0A            }%0A        }%0A    }%0A%0A  # module.load_balancer.aws_lb_listener.https[0] will be created%0A  + resource "aws_lb_listener" "https" {%0A      + arn               = (known after apply)%0A      + certificate_arn   = (known after apply)%0A      + id                = (known after apply)%0A      + load_balancer_arn = "arn:aws:elasticloadbalancing:us-east-1:654654485498:loadbalancer/app/hello-world-api-alb/e5c80950ca5bfd6e"%0A      + port              = 443%0A      + protocol          = "HTTPS"%0A      + ssl_policy        = "ELBSecurityPolicy-2016-08"%0A      + tags_all          = (known after apply)%0A%0A      + default_action {%0A          + order            = (known after apply)%0A          + target_group_arn = "arn:aws:elasticloadbalancing:us-east-1:654654485498:targetgroup/hello-world-api-tg/feeb4478cc4dc18f"%0A          + type             = "forward"%0A        }%0A%0A      + mutual_authentication (known after apply)%0A    }%0A%0A  # module.load_balancer.aws_route53_record.cert_validation["lucasherculano.xyz"] will be created%0A  + resource "aws_route53_record" "cert_validation" {%0A      + allow_overwrite = (known after apply)%0A      + fqdn            = (known after apply)%0A      + id              = (known after apply)%0A      + name            = (known after apply)%0A      + records         = (known after apply)%0A      + ttl             = 60%0A      + type            = (known after apply)%0A      + zone_id         = "Z04073202OY1O6A1PI872"%0A    }%0A%0A  # module.load_balancer.aws_security_group.alb will be updated in-place%0A  ~ resource "aws_security_group" "alb" {%0A        id                     = "sg-023bff4452cc0cdb2"%0A      ~ ingress                = [%0A          - {%0A              - cidr_blocks      = [%0A                  - "0.0.0.0/0",%0A                ]%0A              - from_port        = 80%0A              - ipv6_cidr_blocks = []%0A              - prefix_list_ids  = []%0A              - protocol         = "tcp"%0A              - security_groups  = []%0A              - self             = false%0A              - to_port          = 80%0A                # (1 unchanged attribute hidden)%0A            },%0A          + {%0A              + cidr_blocks      = [%0A                  + "0.0.0.0/0",%0A                ]%0A              + from_port        = 443%0A              + ipv6_cidr_blocks = []%0A              + prefix_list_ids  = []%0A              + protocol         = "tcp"%0A              + security_groups  = []%0A              + self             = false%0A              + to_port          = 443%0A                # (1 unchanged attribute hidden)%0A            },%0A          + {%0A              + cidr_blocks      = [%0A                  + "0.0.0.0/0",%0A                ]%0A              + from_port        = 80%0A              + ipv6_cidr_blocks = []%0A              + prefix_list_ids  = []%0A              + protocol         = "tcp"%0A              + security_groups  = []%0A              + self             = false%0A              + to_port          = 80%0A            },%0A        ]%0A        name                   = "hello-world-api-alb-sg"%0A        tags                   = {}%0A        # (8 unchanged attributes hidden)%0A    }%0A%0APlan: 5 to add, 3 to change, 1 to destroy.%0A
::debug::stderr: 
::debug::exitcode: 0

```
</details>